import React from "react";
import HeadRelationship from "./head-relationship";

const IconRelationship = ({onClick}) => (
  <svg
    width="76"
    height="76" // 높이를 충분히 늘려줘야 두 아이콘이 잘 보임
    viewBox="0 0 76 76"
    fill="none"
    xmlns="http://www.w3.org/2000/svg"
    onClick={onClick} // 클릭 핸들러 추가
    style={{ cursor: "pointer" }} // 클릭 시 커서 변경
  >
    {/* 투명한 클릭 영역 */}
    <rect
      width="76"
      height="76"
      fill="transparent"
      pointerEvents="all" // 클릭 이벤트 감지
    />

    {/* 첫 번째 아이콘 */}
    <g transform="translate(38, 24)"> {/* 가로 중심 (viewBox 가로 절반) */}
      <g transform="translate(-24, -24)"> {/* 첫 번째 아이콘 중심 보정 */}
        <HeadRelationship />
      </g>
    </g>

    {/* 두 번째 아이콘 viewbox=0 0 76 18*/}
    <g transform="translate(38, 62)"> {/* 첫 번째 아이콘보다 10px 아래로 이동 */}
      <g transform="translate(-38, -9)"> {/* 두 번째 아이콘 중심 보정 */}
        <path d="M17.7179 3.68H24.0539V5.392H17.7179V3.68ZM19.5419 7.136H21.6539V10.848H19.5419V7.136ZM23.2219 3.68H25.3179V4.608C25.3179 5.648 25.3179 7.12 24.9659 8.96L22.9019 8.736C23.2219 6.912 23.2219 5.632 23.2219 4.608V3.68ZM26.7579 2.608H28.9019V13.696H26.7579V2.608ZM28.0539 7.12H30.6619V8.864H28.0539V7.12ZM19.0139 15.472H29.3659V17.168H19.0139V15.472ZM19.0139 12.704H21.1419V16H19.0139V12.704ZM17.0459 11.712L16.8539 10.032C19.4139 10.032 22.9819 9.984 25.9579 9.568L26.0859 11.072C23.0299 11.648 19.5899 11.712 17.0459 11.712ZM36.9926 6.512H40.0006V8.208H36.9926V6.512ZM36.9126 10.208H39.9366V11.904H36.9126V10.208ZM42.0166 2.608H44.0486V17.424H42.0166V2.608ZM38.9606 2.928H40.9446V16.768H38.9606V2.928ZM35.6166 4.352H37.6646C37.6646 8.56 36.4006 11.92 32.2726 14.352L31.0726 12.864C34.4166 10.832 35.6166 8.368 35.6166 4.784V4.352ZM31.9206 4.352H36.3366V6.048H31.9206V4.352ZM47.0674 9.216H57.4834V10.912H47.0674V9.216ZM45.5154 14.016H58.9234V15.76H45.5154V14.016ZM51.1314 9.984H53.2594V14.576H51.1314V9.984ZM47.0674 3.616H57.3714V5.328H49.1954V9.952H47.0674V3.616Z" fill="#A98157" />
      </g>
    </g>
  </svg>
);

export default IconRelationship;